package ctci;
//@formatter:off
/**
 *                             _ooOoo_
 *                            o8888888o
 *                            88" . "88
 *                            (| -_- |)
 *                            O\  =  /O
 *                         ____/`---'\____
 *                       .'  \\|     |//  `.
 *                      /  \\|||  :  |||//  \
 *                     /  _||||| -:- |||||-  \
 *                     |   | \\\  -  /// |   |
 *                     | \_|  ''\---/''  |   |
 *                     \  .-\__  `-`  ___/-. /
 *                   ___`. .'  /--.--\  `. . __
 *                ."" '<  `.___\_<|>_/___.'  >'"".
 *               | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *               \  \ `-.   \_ __\ /__ _/   .-` /  /
 *          ======`-.____`-.___\_____/___.-`____.-'======
 *                             `=---='
 *          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *                     佛祖保佑        永无BUG
 *
 * 描述：
 * 有一个介于0和1之间的实数，类型为double，返回它的二进制表示。如果该数字无法精确地用32位以内的二进制表示，返回“Error”。
 * 给定一个double num，表示0到1的实数，请返回一个string，代表该数的二进制表示或者“Error”。
 * 测试样例：0.625返回：0.101
 */
 //@formatter:on

public class _5_2BinDecimal {
    public String printBin(double num) {
        StringBuilder sb = new StringBuilder();
        sb.append("0.");
        while (true) {
            num = num * 2;
            sb.append(num >= 1 ? 1 : 0);
            if (num == 1) break;
            num = num > 1 ? num - 1 : num;
        }
        String res = sb.toString();
        if (res.length() > 32) res = "Error";
        return res;
    }
}

/*
十进制小数转二进制数：“乘以2取整，顺序排列”（乘2取整法）
小数部分：
0.625*2=1.25  （取整数）
0.25*2=0.5
0.5*2=1
然后我们将整数部分按从上往下的顺序书写就是：101

所以：（0.625）（十）=（0.101）（二）
 */