package ctci;
//@formatter:off
/**
 *                             _ooOoo_
 *                            o8888888o
 *                            88" . "88
 *                            (| -_- |)
 *                            O\  =  /O
 *                         ____/`---'\____
 *                       .'  \\|     |//  `.
 *                      /  \\|||  :  |||//  \
 *                     /  _||||| -:- |||||-  \
 *                     |   | \\\  -  /// |   |
 *                     | \_|  ''\---/''  |   |
 *                     \  .-\__  `-`  ___/-. /
 *                   ___`. .'  /--.--\  `. . __
 *                ."" '<  `.___\_<|>_/___.'  >'"".
 *               | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *               \  \ `-.   \_ __\ /__ _/   .-` /  /
 *          ======`-.____`-.___\_____/___.-`____.-'======
 *                             `=---='
 *          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *                     佛祖保佑        永无BUG
 *
 * 描述：编写一个函数，确定需要改变几个位，才能将整数A转变成整数B。给定两个整数int A，int B。请返回需要改变的数位个数。
 * 测试样例：10,5返回：4
 */
 //@formatter:on
public class _5_5Transform {
    public int calcCost(int A, int B) {
        int res = 0;
        if (A == B) return res;
        while (A != 0 || B != 0) {
            if ((A & 1) != (B & 1)) {
                res++;
            }
            if (A != 0)
                A >>= 1;
            if (B != 0)
                B >>= 1;
        }
        return res;
    }

    //法二
    public int calcCost1(int A, int B) {
        return Integer.bitCount(A ^ B);
    }
}
