package ctci;
//@formatter:off
/**
 *                             _ooOoo_
 *                            o8888888o
 *                            88" . "88
 *                            (| -_- |)
 *                            O\  =  /O
 *                         ____/`---'\____
 *                       .'  \\|     |//  `.
 *                      /  \\|||  :  |||//  \
 *                     /  _||||| -:- |||||-  \
 *                     |   | \\\  -  /// |   |
 *                     | \_|  ''\---/''  |   |
 *                     \  .-\__  `-`  ___/-. /
 *                   ___`. .'  /--.--\  `. . __
 *                ."" '<  `.___\_<|>_/___.'  >'"".
 *               | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *               \  \ `-.   \_ __\ /__ _/   .-` /  /
 *          ======`-.____`-.___\_____/___.-`____.-'======
 *                             `=---='
 *          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *                     佛祖保佑        永无BUG
 *
 * 描述：请编写程序交换一个数的二进制的奇数位和偶数位。（使用越少的指令越好）
 * 给定一个int x，请返回交换后的数int。测试样例：10返回：5
 */
 //@formatter:on
public class _5_6Exchange {
    public int exchangeOddEven(int x) {
        return ((x & 0xaaaaaaaa) >>> 1 | (x & 0x55555555) << 1);
    }
}



/*
0xaaaaaaaa = 10101010101010101010101010101010
0x55555555 = 01010101010101010101010101010101

题目意思是数中奇偶位位数相等，而位上对应数字互换
  (x&0xaaaaaaaa)>>>1就是把奇数位清0，偶数位移到奇数位
  (x&0x55555555)<<1就是把偶数位清0，奇数位移到偶数位
 */